src_Extension/Reports/МатериальнаяСпецификацияИзделия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>МатериальнаяСпецификацияИзделия</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Изделие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Деталь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДетали</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМатериала</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяКалькуляции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиКалькуляции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цех</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

src_Extension/Enums/ВариантыПодбораСпецификацииВДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВариантыПодбораСпецификацииВДокументы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Вручную</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_Extension/Enums/СтатусыСпецификаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыСпецификаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРазработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_Extension/Enums/ТипыПроизводственныхПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыПроизводственныхПроцессов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сборка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ремонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Разборка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БезСпецификаций</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_Extension/Reports/МатериальнаяСпецификацияИзделия/Ext/ObjectModule.bsl
//Копия ПеремещениеИзЦехаСМатериалами, ПеремещениеИзЦехаСТрудозатратами, ПланПроизводстваСТрудозатратами
&НаСервере
Перем СтатьяКалькуляцииТехотход;  
Перем СтатьяКалькуляцииПокупныеКомплектующие;
Перем СтатьяКалькуляцииПокупныеМатериалы;
Перем СтатьяКалькуляцииЗамена;
Перем ВидыРаботФиктивные;

Перем ТЗСпецификации;
Перем ТЗМатериалы;
Перем ТЗТрудозатраты;

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, 
		КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	//КомпоновщикНастроек.Настройки, ДанныеРасшифровки);
	
	НайденныйПараметр = Неопределено;
    НайденныйПараметрВарианта = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Спецификация");
    Если НайденныйПараметрВарианта <> Неопределено Тогда
        НайденныйПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(НайденныйПараметрВарианта.ИдентификаторПользовательскойНастройки);
	КонецЕсли;
	Если НайденныйПараметр = Неопределено ИЛИ НЕ НайденныйПараметр.Использование тогда
		Спецификация = Неопределено;
	Иначе	
		Спецификация = НайденныйПараметр.Значение;
	КонецЕсли;
	
	НайденныйПараметр = Неопределено;
    НайденныйПараметрВарианта = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Изделие");
    Если НайденныйПараметрВарианта <> Неопределено Тогда
        НайденныйПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(НайденныйПараметрВарианта.ИдентификаторПользовательскойНастройки);
	КонецЕсли;
	Если НайденныйПараметр = Неопределено ИЛИ НЕ НайденныйПараметр.Использование тогда
		Изделие = Неопределено;
	Иначе	
		Изделие = НайденныйПараметр.Значение;
	КонецЕсли;
		
	РассчитатьМатериалы();
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("Материалы", Материалы);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных,ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
 	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);	
КонецПроцедуры

&НаСервере
Процедура РассчитатьМатериалы()
	Если НЕ ЗначениеЗаполнено(Спецификация) тогда
		Если ЗначениеЗаполнено(Изделие) тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	РесурсныеСпецификации.Ссылка КАК Спецификация
				|ИЗ
				|	Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
				|ГДЕ
				|	РесурсныеСпецификации.ВариантПодбораВДокументы = ЗНАЧЕНИЕ(Перечисление.ВариантыПодбораСпецификацииВДокументы.Автоматически)
				|	И НЕ РесурсныеСпецификации.ПометкаУдаления
				|	И РесурсныеСпецификации.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует)
				|	И РесурсныеСпецификации.ТипПроизводственногоПроцесса = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Сборка)
				|	И РесурсныеСпецификации.ОсновноеИзделиеНоменклатура = &Номенклатура
				|	И (РесурсныеСпецификации.НачалоДействия = ДАТАВРЕМЯ(1, 1, 1)
				|		ИЛИ РесурсныеСпецификации.НачалоДействия <= &ТекущаяДата)
				|	И (РесурсныеСпецификации.КонецДействия = ДАТАВРЕМЯ(1, 1, 1)
				|		ИЛИ РесурсныеСпецификации.КонецДействия > &ТекущаяДата)
				|УПОРЯДОЧИТЬ ПО
				|	РесурсныеСпецификации.Код УБЫВ";
			Запрос.УстановитьПараметр("Номенклатура", Изделие);
			Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
			Выб = Запрос.Выполнить().Выбрать();
			Если Выб.Следующий() тогда
				Спецификация = Выб.Спецификация;
			Иначе
				ВызватьИсключение "У заданного изделия нет основной спецификации!";
			КонецЕсли;
		Иначе
			ВызватьИсключение "Не задано ни изделие, ни спецификация!";
		КонецЕсли;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Изделие) тогда
		Изделие = Спецификация.ОсновноеИзделиеНоменклатура;
	КонецЕсли;
	СтатьяКалькуляцииПокупныеКомплектующие = Справочники.СтатьиКалькуляции.НайтиПоНаименованию("Покупные комплектующие");
	СтатьяКалькуляцииПокупныеМатериалы = Справочники.СтатьиКалькуляции.НайтиПоНаименованию("Покупные материалы");
	СтатьяКалькуляцииЗамена = Справочники.СтатьиКалькуляции.НайтиПоНаименованию("ЗАМЕНА", Истина);
	Материалы.Очистить();
	
	Изделия = Новый ТаблицаЗначений;
	Изделия.Колонки.Добавить("Спецификация", Новый ОписаниеТипов("СправочникСсылка.РесурсныеСпецификации"));
	Изделия.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	Изд1 = Изделия.Добавить();
	Изд1.Спецификация = Спецификация;
	Изд1.Количество = 1000;
	МенеджерВТ = ЭТП.РасчитатьМатериалы(Изделия);
	ЭТП.ПолучитьСборки(МенеджерВТ);
	ЗаполнитьТЗ(МенеджерВТ);
	ЗаполнитьМатериалы();
КонецПроцедуры

Процедура ЗаполнитьМатериалы()
КонецПроцедуры

Процедура ЗаполнитьТЗ(МенеджерВТ)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = ТекстЗапросаМатериалы(); 
	Материалы.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

Функция ТекстЗапросаМатериалы();
	Возврат
	"ВЫБРАТЬ
	|	ВТМат.Номенклатура КАК Материал,
	|	ВТМат.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ВТМат.Подразделение КАК Цех,
	|	СУММА(ВТМат.Количество) КАК КоличествоМатериала,
	|	ВТСборки.Спецификация.ОсновноеИзделиеНоменклатура КАК Деталь,
	|	ВТСборки.Спецификация КАК Спецификация,
	|	ВТСборки.Количество КАК КоличествоДетали
	|ИЗ
	|	ВТСборки КАК ВТСборки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМат КАК ВТМат
	|		ПО ВТСборки.Спецификация = ВТМат.СпецификацияКуда
	|ГДЕ
	|	ВТМат.СпецификацияЧто.Ссылка ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТМат.Номенклатура,
	|	ВТМат.СтатьяКалькуляции,
	|	ВТМат.Подразделение,
	|	ВТСборки.Спецификация.ОсновноеИзделиеНоменклатура,
	|	ВТСборки.Спецификация,
	|	ВТСборки.Количество";
КонецФункции

Функция СведенияОВнешнейОбработке() Экспорт
   
    РегистрационныеДанные = Новый Структура;
    РегистрационныеДанные.Вставить("Наименование", "Материальная спецификация изделия");
    РегистрационныеДанные.Вставить("БезопасныйРежим", Истина);
    РегистрационныеДанные.Вставить("Версия", "1.0");
  
    РегистрационныеДанные.Вставить("Вид", "ДополнительныйОтчет");
  
    РегистрационныеДанные.Вставить("Информация", "Материальная спецификация изделия");
  
    ///////////// команды /////////////////////////
    тзКоманд = Новый ТаблицаЗначений;
    тзКоманд.Колонки.Добавить("Идентификатор");
    тзКоманд.Колонки.Добавить("Представление");
    тзКоманд.Колонки.Добавить("Модификатор");
    тзКоманд.Колонки.Добавить("ПоказыватьОповещение");
    тзКоманд.Колонки.Добавить("Использование");
  
    строкаКоманды = тзКоманд.Добавить();
    строкаКоманды.Идентификатор = "МатериалыНаИзделие";
    строкаКоманды.Представление = "Материальная спецификация изделия";
    строкаКоманды.ПоказыватьОповещение = Истина;
    строкаКоманды.Модификатор = "";
    строкаКоманды.Использование = "ОткрытиеФормы";
  
    РегистрационныеДанные.Вставить("Команды", тзКоманд);
  
    ////////////// назначение (в каких объектах используется) /////////////////////////
    //для печ.форм, заполнения, ввода свазанных объектов
    //МассивНазначений = Новый Массив;
    //МассивНазначений.Добавить("Документ.*"); // все документы назначаются
    //МассивНазначений.Добавить("Документ.ПоступлениеТоваровУслуг");
    //МассивНазначений.Добавить("Документ.ЗаказПокупателя");
    //РегистрационныеДанные.Вставить("Назначение", МассивНазначений);
  
    Возврат РегистрационныеДанные;
              
КонецФункции
